<a href="https://colab.research.google.com/github/amazingashis/Machine_Learning_Full_30_Day/blob/main/Logistic_Regression_Imputation_confusion_matrix.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import numpy as np
import matplotlib.pyplot as plt
import math
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LogisticRegression
from sklearn.metrics import confusion_matrix
from sklearn.metrics import accuracy_score
import pandas as pd

In [3]:
data = pd.read_csv("/content/drive/My Drive/Data/titanic.csv")
data.head()

   pclass  survived  ...   body                        home.dest
0     1.0       1.0  ...    NaN                     St Louis, MO
1     1.0       1.0  ...    NaN  Montreal, PQ / Chesterville, ON
2     1.0       0.0  ...    NaN  Montreal, PQ / Chesterville, ON
3     1.0       0.0  ...  135.0  Montreal, PQ / Chesterville, ON
4     1.0       0.0  ...    NaN  Montreal, PQ / Chesterville, ON

[5 rows x 14 columns]

In [4]:
data = data[["pclass","sex","age","survived"]]
data.describe()

            pclass          age     survived
count  1309.000000  1046.000000  1309.000000
mean      2.294882    29.881135     0.381971
std       0.837836    14.413500     0.486055
min       1.000000     0.166700     0.000000
25%       2.000000    21.000000     0.000000
50%       3.000000    28.000000     0.000000
75%       3.000000    39.000000     1.000000
max       3.000000    80.000000     1.000000

In [9]:
print(data.isna().sum(axis=0))

pclass        0
sex           0
age         263
survived      0
dtype: int64

In [8]:
#dealing with missing values
data = data.dropna(subset = ["sex","pclass","survived"])

In [10]:
data.head()
data.tail()

      pclass     sex   age  survived
1304     3.0  female  14.5       0.0
1305     3.0  female   NaN       0.0
1306     3.0    male  26.5       0.0
1307     3.0    male  27.0       0.0
1308     3.0    male  29.0       0.0

In [11]:
#data Label Encoding
data["sex"] = data["sex"].map({"male":1,"female":0})
data["sex"]

0       0
1       1
2       0
3       1
4       0
       ..
1304    0
1305    0
1306    1
1307    1
1308    1
Name: sex, Length: 1309, dtype: int64

In [15]:
#Features Extraction
features = data[["sex","age","pclass"]]
label = data[["survived"]]
features.head()

   sex      age  pclass
0    0  29.0000     1.0
1    1   0.9167     1.0
2    0   2.0000     1.0
3    1  30.0000     1.0
4    0  25.0000     1.0

In [17]:
label.head()

   survived
0       1.0
1       1.0
2       0.0
3       0.0
4       0.0

In [18]:
#Preprocessing: Imputation | Missing Values in Age
from sklearn.impute import SimpleImputer
imputer = SimpleImputer(missing_values=np.nan,strategy='mean')
features = imputer.fit_transform(features)

In [20]:
features

array([[ 0.    , 29.    ,  1.    ],
       [ 1.    ,  0.9167,  1.    ],
       [ 0.    ,  2.    ,  1.    ],
       ...,
       [ 1.    , 26.5   ,  3.    ],
       [ 1.    , 27.    ,  3.    ],
       [ 1.    , 29.    ,  3.    ]])

In [21]:
features_train,features_test,label_train,label_test = train_test_split(features,label,test_size = 0.2)

In [24]:
print(len(features_train)/len(features))

0.7998472116119175

In [25]:
model = LogisticRegression()
model.fit(features_train,label_train)

/usr/local/lib/python3.6/dist-packages/sklearn/utils/validation.py:760: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
                   intercept_scaling=1, l1_ratio=None, max_iter=100,
                   multi_class='auto', n_jobs=None, penalty='l2',
                   random_state=None, solver='lbfgs', tol=0.0001, verbose=0,
                   warm_start=False)

In [26]:
predictions = model.predict(features_test)

In [29]:
#Confusion Matrix
print("Error \n",confusion_matrix(label_test,predictions))
print("Accuracy \t",accuracy_score(label_test,predictions))

Error
 [[138  33]
 [ 34  57]]
Accuracy 	 0.7442748091603053